Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
 The DimensionPlacingAttributes class controls the placing of the dimension.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DimensionPlacingAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class DimensionPlacingAttributes
	Inherits GenericAttributesBase
The DimensionSetBaseAttributes.DimensionPlacingAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes.DimensionPlacingAttributes()
 Creates a new dimension placing attributes instance. The placing is set to the free placing.
DimensionSetBaseAttributes.DimensionPlacingAttributes(DimensionSetBaseAttributes.Placings, PlacingDirectionAttributes, PlacingDistanceAttributes)
 Creates a new dimension placing attributes instance with the given parameters.
Top
Properties
Name | Description
Direction
 The placing direction.
Distance
 The placing distance attributes.
Placing
 The placing type.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace